from .base import RolePermission  # استيراد الكلاس الأساسي للصلاحيات المبنية على الأدوار


class IsPetOwner(RolePermission):
    """
    صلاحية خاصة بمستخدمين pet_owner فقط

    الفكرة:
    - أي API يستخدم هذا الـ permission
    - يسمح فقط للمستخدمين الذين role حقهم = pet_owner

    الاستخدام:
    - إضافة حيوانات (Pets)
    - تعديل بيانات الحيوانات
    - حذف الحيوانات الخاصة بهم
    """

    # تحديد الأدوار المسموح لها بالدخول لهذا الـ endpoint
    allowed_roles = ["pet_owner"]


class IsVet(RolePermission):
    """
    صلاحية خاصة بالأطباء البيطريين (vet)

    الاستخدام:
    - قراءة بيانات الحيوانات
    - إضافة تشخيصات طبية
    - إدارة التقارير الطبية
    - إدارة المواعيد
    """

    # فقط المستخدمين الذين role = vet يسمح لهم
    allowed_roles = ["vet"]


class IsAdmin(RolePermission):
    """
    صلاحية خاصة بالأدمن (Admin)



    الاستخدام:
    - إدارة المستخدمين
    - الموافقات
    - التحكم الكامل بالنظام
    """

    # فقط الأدمن مسموح له بالدخول
    allowed_roles = ["admin"]